{
  "_name_or_path": "albert-base-v2",
  "architectures": [
    "AlbertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 3,
  "gap_size": 0,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-IMPACT",
    "2": "I-IMPACT",
    "3": "B-AFFECTED",
    "4": "I-AFFECTED",
    "5": "B-SEVERITY",
    "6": "I-SEVERITY",
    "7": "B-LOCATION",
    "8": "I-LOCATION",
    "9": "B-MODIFIER",
    "10": "I-MODIFIER"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 3072,
  "label2id": {
    "B-AFFECTED": 3,
    "B-IMPACT": 1,
    "B-LOCATION": 7,
    "B-MODIFIER": 9,
    "B-SEVERITY": 5,
    "I-AFFECTED": 4,
    "I-IMPACT": 2,
    "I-LOCATION": 8,
    "I-MODIFIER": 10,
    "I-SEVERITY": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_hidden_groups": 1,
  "num_hidden_layers": 12,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.23.1",
  "type_vocab_size": 2,
  "vocab_size": 30000
}
