{
  "_name_or_path": "distilbert-base-cased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-IMPACT",
    "2": "I-IMPACT",
    "3": "B-AFFECTED",
    "4": "I-AFFECTED",
    "5": "B-SEVERITY",
    "6": "I-SEVERITY",
    "7": "B-LOCATION",
    "8": "I-LOCATION",
    "9": "B-MODIFIER",
    "10": "I-MODIFIER"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-AFFECTED": 3,
    "B-IMPACT": 1,
    "B-LOCATION": 7,
    "B-MODIFIER": 9,
    "B-SEVERITY": 5,
    "I-AFFECTED": 4,
    "I-IMPACT": 2,
    "I-LOCATION": 8,
    "I-MODIFIER": 10,
    "I-SEVERITY": 6,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.23.1",
  "vocab_size": 28996
}
