{
  "_name_or_path": "xlnet-base-cased",
  "architectures": [
    "XLNetForTokenClassification"
  ],
  "attn_type": "bi",
  "bi_data": false,
  "bos_token_id": 1,
  "clamp_len": -1,
  "d_head": 64,
  "d_inner": 3072,
  "d_model": 768,
  "dropout": 0.1,
  "end_n_top": 5,
  "eos_token_id": 2,
  "ff_activation": "gelu",
  "id2label": {
    "0": "O",
    "1": "B-IMPACT",
    "2": "I-IMPACT",
    "3": "B-AFFECTED",
    "4": "I-AFFECTED",
    "5": "B-SEVERITY",
    "6": "I-SEVERITY",
    "7": "B-LOCATION",
    "8": "I-LOCATION",
    "9": "B-MODIFIER",
    "10": "I-MODIFIER"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-AFFECTED": 3,
    "B-IMPACT": 1,
    "B-LOCATION": 7,
    "B-MODIFIER": 9,
    "B-SEVERITY": 5,
    "I-AFFECTED": 4,
    "I-IMPACT": 2,
    "I-LOCATION": 8,
    "I-MODIFIER": 10,
    "I-SEVERITY": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "mem_len": null,
  "model_type": "xlnet",
  "n_head": 12,
  "n_layer": 12,
  "pad_token_id": 5,
  "reuse_len": null,
  "same_length": false,
  "start_n_top": 5,
  "summary_activation": "tanh",
  "summary_last_dropout": 0.1,
  "summary_type": "last",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 250
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.23.1",
  "untie_r": true,
  "use_mems_eval": true,
  "use_mems_train": false,
  "vocab_size": 32000
}
